Revit 2024 API
RebarShapeConstraintCircumference.ArcReferenceType Property
 The choice of rule for measuring the diameter.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public RebarShapeArcReferenceType ArcReferenceType { get; }
Visual Basic
Public ReadOnly Property ArcReferenceType As RebarShapeArcReferenceType
	Get
Visual C++
public:
property RebarShapeArcReferenceType ArcReferenceType {
	RebarShapeArcReferenceType get ();
}
See Also
RebarShapeConstraintCircumference Class
Autodesk.Revit.DB.Structure Namespace